# constants.py

"""
Файл з константами для бота, які використовуються в різних модулях.
Централізоване зберігання даних спрощує підтримку та оновлення.
"""

# Список підрозділів для вибору
DIVISIONS = [
    "Офіс",
    "Дніпро",
    "PSC",
    "Біла Церква",
    "Вінниця",
    "Запоріжжя",
    "Київ",
    "Краматорськ",
    "Кривий Ріг",
    "Кропивницький",
    "Львів",
    "Одеса",
    "Полтава",
    "Суми",
    "Харків",
    "Черкаси",
    "Чернігів",
]

# Список департаментів для вибору
DEPARTMENTS = [
    "Комерційний департамент",
    "Операційний департамент",
    "Департамент маркетинга",
    "ІТ департамент",
    "Юр. департамент",
    "Департамент безпеки",
    "Департамент персоналу",
    "Фінансовий департамент",
    "Бухгалтерія",
    "Контрольно ревізійний відділ",
    "Відділ кадрів",
]

# Список сервісів для вибору
SERVICES = [
    "E-mix 2.x",
    "E-mix 3.x",
    "E-supervisor",
    "E-mix market",
    "E-mix market iOS",
    "E-drive",
    "Пошта",
    "Портал техпідтримки",
]

# ID полів для Jira
JIRA_FIELD_IDS = {
    "division": "customfield_10069",  # Балансова Одиниця (Підрозділ)
    "department": "customfield_10065",  # Departament
    "service": "customfield_10068",  # Service
}

# Маппінги підрозділів та їх ID в Jira
DIVISION_ID_MAPPINGS = {
    "Офіс": {"id": "10265", "name": "Офіс"},
    "Дніпро": {"id": "10266", "name": "Дніпро"},
    "PSC": {"id": "10267", "name": "PSC"},
    "Біла Церква": {"id": "10281", "name": "Біла Церква"},
    "Вінниця": {"id": "10280", "name": "Вінниця"},
    "Запоріжжя": {"id": "10269", "name": "Запоріжжя"},
    "Київ": {"id": "10270", "name": "Київ"},
    "Краматорськ": {"id": "10272", "name": "Краматорськ"},
    "Кривий Ріг": {"id": "10273", "name": "Кривий Ріг"},
    "Кропивницький": {"id": "10271", "name": "Кропивницький"},
    "Львів": {"id": "10282", "name": "Львів"},
    "Одеса": {"id": "10278", "name": "Одеса"},
    "Полтава": {"id": "10274", "name": "Полтава"},
    "Суми": {"id": "10275", "name": "Суми"},
    "Харків": {"id": "10276", "name": "Харків"},
    "Черкаси": {"id": "10277", "name": "Черкаси"},
    "Чернігів": {"id": "10279", "name": "Чернігів"},
    "Імпорт": {"id": "10268", "name": "Імпорт"},
}


# Маппінги департаментів та їх ID в Jira
DEPARTMENT_ID_MAPPINGS = {
    "Комерційний департамент": {"id": "10208", "name": "Комерційний департамент"},
    "Операційний департамент": {"id": "10206", "name": "Операційний департамент"},
    "Департамент маркетинга": {"id": "10207", "name": "Департамент маркетинга"},
    "ІТ департамент": {"id": "10209", "name": "ІТ департамент"},
    "Юр. департамент": {"id": "10210", "name": "Юр. департамент"},
    "Департамент безпеки": {"id": "10211", "name": "Департамент безпеки"},
    "Департамент персоналу": {"id": "10212", "name": "Департамент персоналу"},
    "Фінансовий департамент": {"id": "10213", "name": "Фінансовий департамент"},
    "Бухгалтерія": {"id": "10214", "name": "Бухгалтерія"},
    "Контрольно ревізійний відділ": {
        "id": "10215",
        "name": "Контрольно ревізійний відділ",
    },
    "Відділ кадрів": {"id": "10216", "name": "Відділ кадрів"},
    "-": {"id": "10366", "name": "-"},
}


# Маппінги сервісів та їх ID в Jira
SERVICE_ID_MAPPINGS = {
    "ERP": {"id": "10217", "name": "ERP"},
    "E-mix 2.x": {"id": "10226", "name": "E-mix 2.x"},
    "iDoc": {"id": "10223", "name": "iDoc"},
    "Пошта": {"id": "10242", "name": "Пошта"},
    "Contentum": {"id": "10224", "name": "Contentum"},
    "Офісне ПЗ": {"id": "10237", "name": "Офісне ПЗ"},
    "Мобільний зв'язок": {"id": "10241", "name": "Мобільний зв'язок"},
    "Ремонт техніки": {"id": "10244", "name": "Ремонт техніки"},
    "Інтернет": {"id": "10239", "name": "Інтернет"},
    "Управління користувачами": {"id": "10264", "name": "Управління користувачами"},
    "QlikView": {"id": "10225", "name": "QlikView"},
    "ЗУП": {"id": "10219", "name": "ЗУП"},
    "ЗУП КД": {"id": "10220", "name": "ЗУП КД"},
    "ZVIT": {"id": "10235", "name": "ZVIT"},
    "MEDOC": {"id": "10236", "name": "MEDOC"},
    "Edin": {"id": "10261", "name": "Edin"},
    "ЕЦП": {"id": "10249", "name": "ЕЦП"},
    "ВЧАСНО": {"id": "10262", "name": "ВЧАСНО"},
    "Client Bank": {"id": "10256", "name": "Client Bank"},
    "Архівні та тестові БД": {"id": "10248", "name": "Архівні та тестові БД"},
    "GoodWill (роботизація)": {"id": "10234", "name": "GoodWill (роботизація)"},
    "BAS": {"id": "10218", "name": "BAS"},
    "E-mix 3.x": {"id": "10227", "name": "E-mix 3.x"},
    "E-supervisor": {"id": "10228", "name": "E-supervisor"},
    "E-mix market": {"id": "10230", "name": "E-mix market"},
    "E-mix market iOS": {"id": "10231", "name": "E-mix market iOS"},
    "E-drive": {"id": "10229", "name": "E-drive"},
    "E-inventory": {"id": "10232", "name": "E-inventory"},
    "Портал для виробників": {"id": "10257", "name": "Портал для виробників"},
    "Системи виробників (АРМОптимум/SalesWorks/SPOT2D/БизнесАналитика)": {
        "id": "10254",
        "name": "Системи виробників (АРМОптимум/SalesWorks/SPOT2D/БизнесАналитика)",
    },
    "Comarch": {"id": "10260", "name": "Comarch"},
    "FTA (управління мерчендайзингом)": {
        "id": "10233",
        "name": "FTA (управління мерчендайзингом)",
    },
    "PowerBI": {"id": "10255", "name": "PowerBI"},
    "TMS": {"id": "10222", "name": "TMS"},
    "WMS": {"id": "10221", "name": "WMS"},
    "ТСД": {"id": "10251", "name": "ТСД"},
    "VPN,RDP": {"id": "10250", "name": "VPN,RDP"},
    "Файловий сервер": {"id": "10252", "name": "Файловий сервер"},
    "Zoom Rooms/ZOOM": {"id": "10246", "name": "Zoom Rooms/ZOOM"},
    "Антивірус": {"id": "10243", "name": "Антивірус"},
    "Друк": {"id": "10238", "name": "Друк"},
    "Системи бездротового зв'язку (Wi-Fi)": {
        "id": "10240",
        "name": "Системи бездротового зв'язку (Wi-Fi)",
    },
    "Закупівля техніки та облік": {"id": "10245", "name": "Закупівля техніки та облік"},
    "Сайт Євромікс": {"id": "10258", "name": "Сайт Євромікс"},
    "neeka_euromix_bot": {"id": "10263", "name": "neeka_euromix_bot"},
    "Відео та текстові інструкції": {
        "id": "10253",
        "name": "Відео та текстові інструкції",
    },
    "Web server": {"id": "10259", "name": "Web server"},
    "Backup": {"id": "10247", "name": "Backup"},
    "Портал E-VSI": {"id": "10289", "name": "Портал E-VSI"},
    "ANT logistics": {"id": "10297", "name": "ANT logistics"},
    "Tableau": {"id": "10298", "name": "Tableau"},
    "Портал техпідтримки": {"id": "10299", "name": "Портал техпідтримки"},
    "Innora (роботизація)": {"id": "10300", "name": "Innora (роботизація)"},
}


# Маппінги всіх полів для зручності доступу
JIRA_FIELD_MAPPINGS = {
    "customfield_10069": DIVISION_ID_MAPPINGS,  # Балансова Одиниця (Підрозділ)
    "customfield_10065": DEPARTMENT_ID_MAPPINGS,  # Departament
    "customfield_10068": SERVICE_ID_MAPPINGS,  # Service
}
